<?php

return [
    
  'verified' => 'ទន្នន័យពុំទាន់ត្រូវបានពិនិត្យចប់សពគ្រប់ឡើយ',

  'taxtype' => [

    'small' => 'គ្រុមហ៊ុនអ្នកគឺជាក្រុមហ៊ុនប្រភេទតូច',
    'medium' => 'គ្រុមហ៊ុនអ្នកគឺជាក្រុមហ៊ុនប្រភេទមធ្រម',
    'large' => 'គ្រុមហ៊ុនអ្នកគឺជាក្រុមហ៊ុនប្រភេទធំ',

  ],

  'crud' => [

    'success' => [
      'create' => ':name ត្រូវបានបង្កើតថ្មីដោយជោគជ័យ៖ ',
      'update' => ':name ត្រូវបានកែប្រែដោយជោគជ័យ៖ ',
      'delete' => ':name ត្រូវបានលុបចោលដោយជោគជ័យ៖ ',
      'remove' => ':name ត្រូវបានដកចេញដោយជោគជ័យ៖ ',
      'submit' => 'ទន្នន័យត្រូវបានស្នើសុំដោយជោគជ័យ',
      'resubmit' => 'ទន្នន័យត្រូវបានដាក់ឱ្យពិនិត្យឡើងវិញដោយជោគជ័យ',
    ],

    'error' => [
      'wrongpass' => 'ពាក្យសម្ងាត់របស់ពុំត្រឹមត្រូវឡើយ!',
      'delete' => ':name ពុំអាចលុបលុបចោលបានឡើយ៖ ',
    ],
  ],

	'alert' => [

    'title' => [
      'disabled_action' => 'សកម្មភាពពុំដំណើរការ!',
    ],
    'text' => [
      'disabled_form' => 'មិនអាចបញ្ចូលទិន្នន័យបានក្រោយពេលដាក់ស្នើសុំឡើយ!',
    ],
	],

  'swal' => [
    'title' => [
      'save' => 'រក្សាទុក?',
      'offline' => 'អ្នកនៅក្រៅបណ្ដាញយូរពេក',
      'empty_field' => 'សូមបញ្ចូលទិន្នន័យជាមុនសិន',
      'empty' => 'ពុំទាន់មានទិន្នន័យនៅឡើយ',
      'sure' => 'តើ​អ្នក​ប្រាកដ​ឬ​អត់?',
      'delete' => 'តើ​អ្នកចង់លុប :name នេះ​ប្រាកដ​ឬ​អត់?',
      'edit' => 'តើ​អ្នកចង់កែប្រែ :name នេះ​ប្រាកដ​ឬ​អត់?',
      'submit' => 'តើអ្នកពិតជាចង់ធ្វើការស្នើសុំមែនឬទេ?',
      'resubmit' => 'តើអ្នកពិតជាចង់ឱ្យឆែកឡើងវិញមែនទេ?',
      'no_one_percent_tax' => 'តើមានការអនុគ្រោះពន្ធដែរទេ?',
    ],
    'text' => [
      'save' => 'តើអ្នកចង់រក្សាទុកមែនទេ?',
      'no_one_percent_tax' => 'ក្រុមហ៊ុននេះមានការអនុគ្រោះពន្ធកាលពីខែមុ តើអ្នកចង់បើកការអនុគ្រោះពន្ធក្នុងខែនេះដែរទេ?',
      'offline' => 'សូមចុចយល់ព្រមដើម្បីផ្ទុកឡើងវិញម្ដងទៀត',
      'empty_field' => 'សូមបញ្ចូលទិន្នន័យដែលមានសញ្ញាផ្កាយជាដាច់ខាត',
      'unrevertible' => 'អ្នកនឹងមិនអាចត្រឡប់វាវិញបានទេ!',
      'revertible' => 'អ្នកនឹងអាចត្រឡប់វាវិញបានគ្រប់ពេល!',
      'submit' => 'សូមមេត្តាពិនិត្យឱ្យច្បាស់មុនពេលធ្វើការស្នើសុំ',
      'resubmit' => 'សូមមេត្តាពិនិត្យឱ្យច្បាស់មុនពេលឱ្យឆែកមើលឡើងវិញ',
    ],
    'button' => [
      'recheck' => 'ពិនិត្យឡើងវិញ',
      'submit_next' => 'ស្នើសុំបន្ត',
      'no' => 'មិនយល់ព្រម',
      'yes' => 'យល់ព្រម',
    ],
    'result' => [
      'title' => [
        'save' => 'រក្សាទុកដោយជោគជ័យ',
        'wrong' => ':name ពុំត្រឹមត្រូវឡើយ!',
        'success' => 'ជោគជ័យ',
      ],
      'text' => [
        'submit' => 'ការស្នើសុំត្រូបានដាក់ស្នើដោយជោគជ័យ',
        'resubmit' => 'ការដាក់ឱ្យឆែកមើលឡើងវិញដោយជោគជ័យ',
        'delete' => ':name ត្រូវបានលុបចោលដោយជោគជ័យ',
        'save' => ':name ត្រូវបានរក្សាទុក',
        'duplicate' => 'ពុំអាចបញ្ចូលលេខវិក្កយបត្រដូចគ្នាក្នុងឆ្នាំតែមួយបានទេ',
        'duplicate1' => 'ទិន្ន័យជាន់គ្នាមិនអាចបញ្ចូលបាន',
        'no_one_percent_tax' => 'ការអនុគ្រោះពន្ធបានបើកដោយជោគជ័យ',
      ],
      'button' => [
        'no' => 'មិនយល់ព្រម',
        'yes' => 'យល់ព្រម',
      ],
    ],
  ],

  'swaljs' => [
  	'title' => [
      'empty_field' => 'សូមបញ្ចូលទិន្នន័យជាមុនសិន',
      'empty' => 'ពុំទាន់មានទិន្នន័យនៅឡើយ',
    	'sure' => 'តើ​អ្នក​ប្រាកដ​ឬ​អត់?',
      'edit' => 'តើ​អ្នកចង់កែប្រែ :name នេះ​ប្រាកដ​ឬ​អត់?',
      'delete' => 'តើ​អ្នកចង់លុប :name នេះ​ប្រាកដ​ឬ​អត់?',
      
      'delete_purchase' => 'តើ​អ្នកចង់លុប ការទិញ នេះ​ប្រាកដ​ឬ​អត់?',
      'delete_sale' => 'តើ​អ្នកចង់លុប ការលក់ នេះ​ប្រាកដ​ឬ​អត់?',
      'delete_salary' => 'តើ​អ្នកចង់លុប ប្រាក់ខែ នេះ​ប្រាកដ​ឬ​អត់?',
  	],
    'text' => [
      'empty_field' => 'សូមបញ្ចូលទិន្នន័យដែលមានសញ្ញាផ្កាយជាដាច់ខាត',
    	'unrevertible' => 'អ្នកនឹងមិនអាចត្រឡប់វាវិញបានទេ!',
    	'revertible' => 'អ្នកនឹងអាចត្រឡប់វាវិញបានគ្រប់ពេល!',
    ],
    'button' => [
	    'no' => 'មិនយល់ព្រម',
	    'yes' => 'យល់ព្រម',
    ],
    'result' => [
	  	'title' => [
        'wrong' => ':name ពុំត្រឹមត្រូវឡើយ!',
        'success' => 'ជោគជ័យ',
        
        'no_selected_id' => 'ចុចជ្រើសរើសយ៉ាងតិចមួយដើម្បីលុប!',
	  	],
	    'text' => [
	    	'delete' => 'ទិន្នន័យត្រូវបានលុបចោលដោយជោគជ័យ',
	    	'save' => 'ទិន្នន័យត្រូវបានរក្សាទុក',
	    ],
	    'button' => [
		    'no' => 'មិនយល់ព្រម',
		    'yes' => 'យល់ព្រម',
	    ],
    ],
  ],

  'modal' => [
    'title' => [
      'add_business_objective' => 'បង្កើតសកម្មភាពអាជីវកម្ម',
      'add_user' => 'បង្កើតអ្នកប្រើប្រាស់',
      'change_password' => 'ផ្លាស់ប្ដូរពាក្យសម្ងាត់',
      'password_confirm' => 'បញ្ជាក់ពាក្យសម្ងាត់',
      'choose_year' => 'សូមជ្រើសរើសឆ្នាំ',
      'choose_print_date' => 'សូមជ្រើសរើសថ្ងៃខែបោះពុម្ភ',
      'purchase' => 'ទិនានុប្បវត្តិទិញ',
      'sale' => 'ទិនានុប្បវត្តិលក់',
      'salary' => 'ពន្ធកាត់ទុកលើប្រាក់ខែ',
      'add_supplier' => 'បង្កើតអ្នកផ្គត់ផ្គង់',
      'add_customer' => 'បង្កើតអ្នកអតិថិជន',
    ],
    'form' => [
      'password_confirm' => 'បញ្ចូលពាក្យសម្ងាត់អ្នក',
      'current_password' => 'ពាក្យសម្ងាត់បច្ចុប្បន្ន',
      'new_password' => 'ពាក្យសម្ងាត់ថ្មី',
      'confirm_password' => 'បញ្ជាក់-ពាក្យសម្ងាត់ថ្មី',
    ],
    'button' => [
      'close' => 'បិទ',
    ],
  ]


];
